CaptainPotatoes/nRF51-ADS1291-MPU-9x5x-Bluetooth-LE-Firmware/main.c
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);
    
    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);
    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);
    
    // Enable BLE stack.
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Device Manager events.
 *
 * @param[in] p_evt  Data associated to the device manager event.
 */
static uint32_t device_manager_evt_handler(dm_handle_t const * p_handle,
                                           dm_event_t const  * p_event,
                                           ret_code_t        event_result)
{
    APP_ERROR_CHECK(event_result);
    return NRF_SUCCESS;
}


/**@brief Function for the Device Manager initialization.
 *
 * @param[in] erase_bonds  Indicates whether bonding information should be cleared from
 *                         persistent storage during initialization of the Device Manager.
 */
static void device_manager_init(bool erase_bonds)
{
    uint32_t               err_code;
    dm_init_param_t        init_param = {.clear_persistent_data = erase_bonds};
    dm_application_param_t register_param;

    // Initialize persistent storage module.
    err_code = pstorage_init();
    APP_ERROR_CHECK(err_code);

    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);

    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));

    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.lesc         = SEC_PARAM_LESC;
    register_param.sec_param.keypress     = SEC_PARAM_KEYPRESS;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}
#if (defined(MPU60x0) || defined(MPU9150) || defined(MPU9255))
/**
 * @brief TWI events handler.
 */
void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{   
	switch(p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            // If EVT_DONE (event done) is received a device is found and responding on that particular address
            //NRF_LOG_PRINTF("\r\n!****************************!\r\nDevice found at 7-bit address: %#x!\r\n!****************************!\r\n\r\n");
						//device_found = true;
            break;
        case NRF_DRV_TWI_EVT_ADDRESS_NACK:
            //NRF_LOG_PRINTF("No address ACK on address: %#x!\r\n");
            break;
        case NRF_DRV_TWI_EVT_DATA_NACK:
            //NRF_LOG_PRINTF("No data ACK on address: %#x!\r\n");
            break;
        default:
            break;        
    }   
    // Pass TWI events down to the MPU driver.
    mpu_twi_event_handler(p_event);
		UNUSED_PARAMETER(p_context);
}

/**
 * @brief TWI initialization.
 * Nothing special here
 */
void twi_setup(void)
{
    ret_code_t err_code;
    
    /**/const nrf_drv_twi_config_t twi_mpu_config = {
       .scl                = MPU_TWI_SCL_PIN,//MPU_TWI_SCL_PIN,
       .sda                = MPU_TWI_SDA_PIN,//MPU_TWI_SDA_PIN,
       .frequency          = NRF_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH
    };
		//nrf_drv_twi_config_t twi_mpu_config = NRF_DRV_TWI_DEFAULT_CONFIG(1);
    
    err_code = nrf_drv_twi_init(&m_twi_instance, &twi_mpu_config, twi_handler, NULL);
		NRF_LOG_PRINTF("ERRCODE: nrf_drv_twi_init: %d \r\n", err_code);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_PRINTF(" TWI (I2C) Enabled! \r\n");
    nrf_drv_twi_enable(&m_twi_instance);
}

void mpu_setup(void)
{
    ret_code_t ret_code;
    // Initiate MPU driver with TWI instance handler
    ret_code = mpu_init(&m_twi_instance);
		NRF_LOG_PRINTF("ERRCODE: mpu_init: %d \r\n", ret_code);
    //APP_ERROR_CHECK(ret_code); // Check for errors in return value
    
    // Setup and configure the MPU with intial values
    mpu_config_t p_mpu_config = MPU_DEFAULT_CONFIG(); // Load default values
    p_mpu_config.smplrt_div = 19;   // Change sampelrate. Sample Rate = Gyroscope Output Rate / (1 + SMPLRT_DIV). 19 gives a sample rate of 50Hz
    p_mpu_config.accel_config.afs_sel = AFS_2G; // Set accelerometer full scale range to 2G
    ret_code = mpu_config(&p_mpu_config); // Configure the MPU with above values
	  NRF_LOG_PRINTF("ERRCODE: mpu_config: %d \r\n", ret_code);
    //APP_ERROR_CHECK(ret_code); // Check for errors in return value 
}

#endif /**@(defined(MPU60x0) || defined(MPU9150) || defined(MPU9255))*/

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}
#if (defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))
void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
		UNUSED_PARAMETER(pin);
		UNUSED_PARAMETER(action);
    m_drdy = true;
}
#endif //(defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))

/**@OLD GPIO INIT (ALSO WORKS FINE!)*/
/*static void gpio_init(void) {
		nrf_gpio_pin_dir_set(ADS1291_2_DRDY_PIN, NRF_GPIO_PIN_DIR_INPUT);
		nrf_gpio_pin_dir_set(ADS1291_2_PWDN_PIN, NRF_GPIO_PIN_DIR_OUTPUT);
		ret_code_t err_code;
		err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);
		//Send data when drdy is low? (see datasheet).
		bool is_high_accuracy = true;
		nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(is_high_accuracy);
		//nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_LOTOHI(is_high_accuracy);
		in_config.is_watcher = false;
		in_config.pull = NRF_GPIO_PIN_NOPULL;
		err_code = nrf_drv_gpiote_in_init(DRDY_GPIO_PIN_IN, &in_config, in_pin_handler);
    APP_ERROR_CHECK(err_code);
		nrf_drv_gpiote_in_event_enable(DRDY_GPIO_PIN_IN, true);
}*/
#if (defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))
static void gpio_init(void) {
		nrf_gpio_pin_dir_set(ADS1291_2_DRDY_PIN, NRF_GPIO_PIN_DIR_INPUT); //sets 'direction' = input/output
		nrf_gpio_pin_dir_set(ADS1291_2_PWDN_PIN, NRF_GPIO_PIN_DIR_OUTPUT);
		uint32_t err_code;
		if(!nrf_drv_gpiote_is_init())
		{
				err_code = nrf_drv_gpiote_init();
		}
		NRF_LOG_PRINTF("nrf_drv_gpiote_init: %d\r\n",err_code);
    APP_ERROR_CHECK(err_code);/**/
		bool is_high_accuracy = true;
		nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(is_high_accuracy);
		in_config.is_watcher = true;
		in_config.pull = NRF_GPIO_PIN_NOPULL;
		err_code = nrf_drv_gpiote_in_init(DRDY_GPIO_PIN_IN, &in_config, in_pin_handler);
		NRF_LOG_PRINTF(" nrf_drv_gpiote_in_init: %d: \r\n",err_code);
		APP_ERROR_CHECK(err_code);
		nrf_drv_gpiote_in_event_enable(DRDY_GPIO_PIN_IN, true);
		ads1291_2_powerdn();
}
#endif //(defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))

/**@brief Function for application main entry.
 */
int main(void)
{
		NRF_LOG_PRINTF(" BLE ECG WITH MPU - START..\r\n");
    uint32_t err_code;
    bool erase_bonds;
    // Initialize.
    timers_init();
    ble_stack_init();
		err_code = nrf_drv_clock_init();
		NRF_LOG_PRINTF("ERRCODE: DRV CLOCK: %d \r\n", err_code);
		APP_ERROR_CHECK(err_code);
		#if (defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))
		gpio_init();
		#endif //(defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))
    device_manager_init(erase_bonds);
    gap_params_init();
    advertising_init();
		#if defined(BLE_BAS)
			adc_configure();
		#endif
    services_init();
    conn_params_init();

		//SPI STUFF FOR ADS:.
		#if (defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))
		ads1291_2_powerup();
		ads_spi_init();		
		
