CaptainPotatoes/nRF51-ADS1291-MPU-9x5x-Bluetooth-LE-Firmware/main.c
		//init_buf(m_tx_data_spi, m_rx_data_spi, TX_RX_MSG_LENGTH);
		// Stop continuous data conversion and initialize registers to default values
		ads1291_2_stop_rdatac();
		ads1291_2_init_regs();
					
		ads1291_2_soft_start_conversion();
			ads1291_2_check_id();
		ads1291_2_start_rdatac();
			
		// Put AFE to sleep while we're not connected
		ads1291_2_standby();
		body_voltage_t body_voltage;
		#endif //(defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))
					
		#if (defined(MPU60x0) || defined(MPU9150) || defined(MPU9255))
		/**@MPU STUFF:*/
			twi_setup();
			//device_address = 0x68;
			uint8_t dummy_data = 0x55;
		nrf_drv_twi_tx(&m_twi_instance, 0x68, &dummy_data, 1, false);
		nrf_delay_ms(12);
			mpu_setup();
			accel_values_t accel_values;
			gyro_values_t   gyro_values;
//			magn_values_t   magn_values;
//			temp_value_t    temperature;
		#endif /**@(defined(MPU60x0) || defined(MPU9150) || defined(MPU9255))*/
		
    // Start execution.
    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
		NRF_LOG_PRINTF(" BLE Advertising Start! \r\n");
		
		// Enter main loop.
    for (;;)
    {
				#if (defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))
			
				if(m_drdy) {
						m_drdy = false;
						get_bvm_sample(&body_voltage);
						ble_bms_update(&m_bms, &body_voltage);
				}
				#endif //(defined(ADS1291) || defined(ADS1292) || defined(ADS1292R))
				//Send all values (50ms), handled by timer
				#if (defined(MPU60x0) || defined(MPU9150) || defined(MPU9255))
				if(mpu_read_send_flag) {
						//read & send values via thing.
						mpu_read_accel(&accel_values);
						mpu_read_gyro(&gyro_values);
						//mpu_read_magn(&magn_values);
						//mpu_read_temp(&temperature);
						combined_values_t combined_values = {
							accel_values.x, accel_values.y, accel_values.z,
							gyro_values.x, gyro_values.y, gyro_values.z
						};
            //ble_mpu_accel_update(&m_mpu, &accel_values);
						//ble_mpu_gyro_update(&m_mpu, &gyro_values);
						//ble_mpu_magnt_update(&m_mpu, &magn_values);
						//ble_mpu_temp_update(&m_mpu, &temperature);
						ble_mpu_combined_update(&m_mpu, &combined_values);
						mpu_read_send_flag = false;
				}
				#endif /**@(defined(MPU60x0) || defined(MPU9150) || defined(MPU9255))*/
				power_manage();
    }
}

/**
 * @}
 */
